/**
 * 3009 : 네 번째 점
 * 
 * 세 점이 주어졌을 때, 축에 평행한 직사각형을 만들기 위해서
 * 필요한 네 번째 점을 찾는 프로그램을 작성
 * 
 * 입력
 * 세 점의 좌표가 한 줄에 하나씩 주어진다.
 * 좌표는 1보다 크거나 같고, 1000보다 작거나 같은 정수이다.
 * 
 * 출력
 * 직사각형의 네 번째 점의 좌표를 출력한다.
 */
// 임의의 x 좌표가 다른 좌표랑 x 값이 같은 경우 나머지 좌표의 x 값이 새로운 점의 x 좌표이다.
// 임의의 y 좌표가 다른 좌표랑 y 값이 같은 경우 나머지 좌표의 y 값이 새로운 점의 y 좌표이다.
#include <iostream>

using namespace std;

int main(void)
{
	int x1, y1, x2, y2, x3, y3;
	int x4, y4;

	cin >> x1 >> y1 >> x2 >> y2 >> x3 >> y3;
	if (x1 == x2) {
		x4 = x3;	
	} else if (x1 == x3) {
		x4 = x2;
	} else {
		x4 = x1;
	}

	if (y1 == y2) {
		y4 = y3;
	} else if (y2 == y3) {
		y4 = y1;
	} else {
		y4 = y2;
	}
	cout << x4 << ' ' << y4 << '\n';
}
