/**
 * 1904 : 01타일
 * 
 * 각각의 타일들은 0 또는 1이 쓰여 있는 낱장의 타일들이다.
 * 0 이 쓰여진 낱장의 타일들을 붙여서 한 쌍으로 이루어진 00 타일들을 만들었다.
 * 결국 현재 1 하나만으로 이루어진 타일 또는 0 타일을 두 개 붙인 한 쌍의 00타일들만이
 * 남게 되었다.
 * 타일로 더 이상 크기가 N인 모든 2진 수열을 만들 수 없게 되었다.
 * N = 1일때, 1만 만들수 있고,
 * N = 2일때, 00, 11을 만들 수 있다.
 * N = 4일때, 0011, 0000, 1001, 1100, 1111 5개의 2진 수열을 만들 수 있다.
 * N 이 주어졌을 떄 지원이가 만들 수 있는 모든 가짓수를 세는 것
 * 타일은 무한히 많다고 가정
 * 
 * 출력 -> 길이가 N인 모든 2진 수열의 개수를 15746으로 나눈 나머지
 */
#include <iostream>
#include <string>

using namespace std;

int N;

void solve()
{
	
}

int main(void)
{
	cin >> N;
	solve();
}
